 #Область СлужебныйПрограммныйИнтерфейс
 //Доработка конфигурации на поддержке
 //Добавление новых реквизитов на форму
 //Кошкалда Н.А.
 Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(ЭтаФорма) Экспорт
	 
	 Если ЭтаФорма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		 ПолеВвода = ЭтаФорма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаШапкаПраво);
		 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		 ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	 КонецЕсли;
	 	 
 КонецПроцедуры   
 
 Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(ЭтаФорма) Экспорт
	 
	 Если ЭтаФорма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		 ПолеВвода = ЭтаФорма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ЭтаФорма, ЭтаФорма.Элементы.СуммаДокумента);
		 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		 ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	 КонецЕсли;
	 
 КонецПроцедуры   
 
 Процедура ДобавитьРеквизитыЗаказПокупателя(ЭтаФорма) Экспорт
     
     НовыеРеквизиты = Новый Массив;
     
     РеквизитСкидка = Новый РеквизитФормы("СогласованнаяСкидка",
    				Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5,2,ДопустимыйЗнак.Неотрицательный)),
    				"",
    				"Согласованная скидка", Истина);  
    				
     РеквизитКонтактноеЛицо = Новый РеквизитФормы("КонтактноеЛицо",
    				Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица"),
    				"",
    				"Контактное лицо", Истина); 
    				
	Команда = ЭтаФорма.Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "ПересчитатьТаблицу";
					
	НовыеРеквизиты.Добавить(РеквизитСкидка);
    НовыеРеквизиты.Добавить(РеквизитКонтактноеЛицо); 
    
    ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизиты);  
	
	НоваяГруппаФормы = ЭтаФорма.Элементы.Добавить("Скидка", Тип("ГруппаФормы"),ЭтаФорма.Элементы.ГруппаШапкаЛево);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),ЭтаФорма.Элементы.Скидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнаяСкидка");
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";

	
	КнопкаФормы = ЭтаФорма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"),ЭтаФорма.Элементы.Скидка); 
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ЭтаФорма.Элементы.ПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
	ЭтаФорма.Элементы.ПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
    				
 КонецПроцедуры
 
#КонецОбласти 
